---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.NoRotateMirrorZError
source: html/6e3e88fe-a874-9449-6b5b-7f9cc6380d41.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.NoRotateMirrorZError Property

Element cannot be mirrored or rotated in a manner that changes its angle relative to the ground.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoRotateMirrorZError { get; }
```